brew 'mas'

brew 'python'
brew 'pyenv'
brew 'rustup-init'

# for Bitwarden V2 (Alfred Workflow)
brew 'bitwarden-cli'

# for Quick translate (Alfred Workflow)
brew translate-shell
brew jq
brew coreutils
brew curl

cask 'alfred'
cask 'alt-tab'
cask 'bettertouchtool'
cask 'cmd-eikana'
cask 'dropbox'
cask 'firefox'
cask 'fluor'
cask 'google-chrome'
cask 'onedrive'
cask 'iterm2'
cask 'iina'
cask 'shifty'
cask 'slack'
cask 'pdf-expert'
cask 'microsoft-auto-update'
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'notion'
cask 'visual-studio-code'
cask 'DamascenoRafael/tap/reminders-menubar'

mas 'Adblock Plus', id: 1432731683
mas 'Bitwarden', id: 1352778147
mas 'Dark Reader for Safari', id: 1438243180
mas 'Focus', id: 777233759
mas 'GoodNotes', id: 1444383602
mas 'Keepa - Price Tracker', id: 1533805339
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas '辞書 by 物書堂', id: 1380563956

# tap "heroku/brew"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
# brew "autoconf"
# brew "binutils"
# brew "bitwarden-cli"
# brew "glib"
# brew "sqlite"
# brew "python@3.9"
# brew "coreutils"
# brew "libidn2"
# brew "curl"
# brew "dosfstools"
# brew "guile"
# brew "gnutls"
# brew "harfbuzz"
# brew "libass"
# brew "ffmpeg"
# brew "gawk"
# brew "gobject-introspection"
# brew "jq"
# brew "libslirp"
# brew "libyaml"
# brew "mas"
# brew "nasm"
# brew "openjdk@11"
# brew "python@3.10"
# brew "qemu"
# brew "ruby-build"
# brew "rbenv"
# brew "translate-shell"
# brew "yarn"
# brew "heroku/brew/heroku"
# cask "alt-tab"
# cask "fluor"
# cask "shifty"
# cask "utm"
# mas "Adblock Plus", id: 1432731683
# mas "Bitwarden", id: 1352778147
# mas "Dark Reader for Safari", id: 1438243180
# mas "Focus", id: 777233759
# mas "GoodNotes", id: 1444383602
# mas "Keepa - Price Tracker", id: 1533805339
# mas "Keynote", id: 409183694
# mas "LINE", id: 539883307
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft Outlook", id: 985367838
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Word", id: 462054704
# mas "Numbers", id: 409203825
# mas "OneDrive", id: 823766827
# mas "Pages", id: 409201541
# mas "The Unarchiver", id: 425424353
# mas "TickTick", id: 966085870
# mas "Xcode", id: 497799835
# mas "辞書 by 物書堂", id: 1380563956
