tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
brew "bitwarden-cli"
brew "coreutils"
brew "curl"
brew "git"
brew "icarus-verilog"
brew "jq"
brew "mas"
brew "php"
brew "pyenv"
brew "python@3.11"
brew "rustup-init"
brew "zsh"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "basecamp"
cask "bettertouchtool"
cask "deepl"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "gtkwave"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "onedrive"
cask "pdf-expert"
cask "reminders-menubar"
cask "shifty"
cask "slack"
cask "visual-studio-code"
cask "webex"
cask "xquartz"
cask "zoom"
mas "Adblock Plus", id: 1432731683
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Focus", id: 777233759
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "辞書 by 物書堂", id: 1380563956
vscode "13xforever.language-x86-64-assembly"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "eamodio.gitlens"
vscode "geddski.macros"
vscode "GitHub.copilot"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "mshr-h.veriloghdl"
vscode "oderwat.indent-rainbow"
vscode "panicbit.cargo"
vscode "pnp.polacode"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "theonekevin.icarusext"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wmaurer.change-case"
