13xforever.language-x86-64-assembly
cschlosser.doxdocgen
dan-c-underwood.arm
eamodio.gitlens
geddski.macros
github.copilot-chat
jeff-hykin.better-cpp-syntax
mosapride.zenkaku
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
mshr-h.veriloghdl
oderwat.indent-rainbow
pnp.polacode
redhat.java
rust-lang.rust-analyzer
serayuzgur.crates
sleistner.vscode-fileutils
tamasfe.even-better-toml
theonekevin.icarusext
twxs.cmake
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
wmaurer.change-case
