tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "sikarugir-app/sikarugir"
brew "bitwarden-cli"
brew "coreutils"
brew "cask"
brew "curl"
brew "icarus-verilog"
brew "jq"
brew "mas"
brew "php"
brew "pyenv"
brew "python@3.11"
brew "qemu"
brew "rustup"
brew "translate-shell"
brew "zsh"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "basecamp"
cask "bettertouchtool"
cask "claude"
cask "deepl"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "onedrive"
cask "pdf-expert"
cask "reminders-menubar"
cask "shifty"
cask "sikarugir-app/sikarugir/sikarugir"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "webex"
cask "whisky"
cask "xquartz"
cask "zoom"
mas "AdBlock", id: 1402042596
mas "Adblock Plus", id: 1432731683
mas "AdBlock Pro", id: 1018301773
mas "Be Focused", id: 973134470
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PocketTube", id: 1533703891
mas "The Unarchiver", id: 425424353
mas "Video Speed Controller", id: 1588368612
mas "辞書 by 物書堂", id: 1380563956
vscode "13xforever.language-x86-64-assembly"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "eamodio.gitlens"
vscode "geddski.macros"
vscode "github.copilot-chat"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mshr-h.veriloghdl"
vscode "oderwat.indent-rainbow"
vscode "pnp.polacode"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "theonekevin.icarusext"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wmaurer.change-case"
cargo "cargo-binutils"
